const messages = {
  // index.js messages:
  help: `Шановні! В будь-якій незрозумілій ситуації *ЗУПИНЯЙТЕ* бота та *ЗАПУСКАЙТЕ* його знову! І, до речі, якщо помітили баг, то хутчіш пишіть сюди @aendrevv, або використовуйте команду /support, чи тисніть на 🤖 *Підтримка* у головному меню /main 😎`,
  support: `Напишіть, будь-ласка, максимально стисло та інформативно Ваше запитання і ми відповімо Вам так швидко, як тільки зможемо 🤗`,
  // newUser.js messages:
  newUser: `Вітаю Вас ! Ви тут вперше, тому пройдіть реєстрацію, будь-ласка, після чого Вам буде доступним увесь функціонал.`,
  hello: `Давайте знайомитися!\nНатисни кнопку нижче 📱`,
  enterDOB: `🔞 Введіть, будь-ласка, дату Вашого народження:\n(у форматі: YYYY.MM.DD)`,
  reEnterDOB:   `🤦‍♂️ Введіть дату народження в форматі:\nYYYY.MM.DD`,
  noEmail: `Введіть, будь-ласка, email:`,
  noCity: `🤦‍♂️ Нема такого населеного пункта.`,
  noName: `🤦‍♂️ Нема такого ім'я.`,
  no18: '🔞 Сервіс лише для повнолітніх! Чекаємо Вас знову!',
  bloodTypeQuestion: `Ну і найголовніше: \nяка у Вас група крові?`,
  rhesusQuestion: `Ваш резус-фактор?`,
  congrats: `🎉 Вітаємо!\nВи стали учасником проекту! 💉\nTисни /main для головного меню.`,  
  // createDemand.js messages:
  demandWelcome: `Ви вирішили створити нову заявку на донорську кров, я Вам із цим допоможу.`,
  demandBloodType: `Почнемо з найголовнішого:\nкров якої групи Ви потребуєте?`,
  emptyDemandsList: `Наразі немає актуальних заявок ☹️`,
  emptyDonorsList: `Наразі відсутні донори, які задовольняли би Вашим потребам ☹️`,
  demandCongrats: `Заявку створено! 💉\nTисни /main для головного меню.`,
  reason: `Розкажіть, будь-ласка, для чого Вам потрібна донорська кров, а також додаткову інформацію:`,
  remove: ``,
  zzz: ``,
  vvv: ``,
  
  // another messages
  yyy: ``,
};

module.exports = messages;